RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_timer.c
    /* write 0 after write 1 to force clock division */
    tmpVal = BL_RD_REG(TIMERx, TIMER_TCDR_FORCE);

    if (timerCh == TIMER_CH0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, TIMER_TCDR2_FORCE);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, TIMER_TCDR3_FORCE);
    }

    BL_WR_REG(TIMERx, TIMER_TCDR_FORCE, tmpVal);

    tmpVal = BL_RD_REG(TIMERx, TIMER_TCDR_FORCE);

    if (timerCh == TIMER_CH0) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, TIMER_TCDR2_FORCE);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, TIMER_TCDR3_FORCE);
    }

    BL_WR_REG(TIMERx, TIMER_TCDR_FORCE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TIMER install interrupt callback
 *
 * @param  timerId: Timer ID type
 * @param  timerChan: TIMER channel type
 * @param  intType: TIMER interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void TIMER_Int_Callback_Install(TIMER_ID_Type timerId, TIMER_Chan_Type timerChan, TIMER_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerChan));
    CHECK_PARAM(IS_TIMER_INT_TYPE(intType));

    timerIntCbfArra[timerId][timerChan][intType] = cbFun;
}
#endif

/****************************************************************************/ /**
 * @brief  TIMER set watchdog clock source and clock division
 *
 * @param  wdtId: Watchdog ID type
 * @param  clkSrc: Watchdog timer clock source type
 * @param  div: Watchdog timer clock division value
 *
 * @return None
 *
*******************************************************************************/
void WDT_Set_Clock(WDT_ID_Type wdtId, TIMER_ClkSrc_Type clkSrc, uint8_t div)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));
    CHECK_PARAM(IS_TIMER_CLKSRC_TYPE(clkSrc));

    /* Configure watchdog timer clock source */
    tmpVal = BL_RD_REG(TIMERx, TIMER_TCCR);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_CS_WDT, clkSrc);
    BL_WR_REG(TIMERx, TIMER_TCCR, tmpVal);

    /* Configure watchdog timer clock divison */
    tmpVal = BL_RD_REG(TIMERx, TIMER_TCDR);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_WCDR, div);
    BL_WR_REG(TIMERx, TIMER_TCDR, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TIMER get watchdog match compare value
 *
 * @param  wdtId: Watchdog ID type
 *
 * @return Watchdog match comapre register value
 *
*******************************************************************************/
uint16_t WDT_GetMatchValue(WDT_ID_Type wdtId)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));

    WDT_ENABLE_ACCESS(TIMERx);

    /* Get watchdog timer match register value */
    tmpVal = BL_RD_REG(TIMERx, TIMER_WMR);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, TIMER_WMR);

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  TIMER set watchdog match compare value
 *
 * @param  wdtId: Watchdog ID type
 * @param  val: Watchdog match compare value
 *
 * @return None
 *
*******************************************************************************/
void WDT_SetCompValue(WDT_ID_Type wdtId, uint16_t val)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));

    WDT_ENABLE_ACCESS(TIMERx);

    /* Set watchdog timer match register value */
    tmpVal = BL_RD_REG(TIMERx, TIMER_WMR);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_WMR, val);
    BL_WR_REG(TIMERx, TIMER_WMR, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Watchdog enable or disable compare value effect immediately after update
 *
 * @param  wdtId: Watchdog ID type
 * @param  enable: Enable or disable
 *
 * @return None
 *
*******************************************************************************/
void WDT_CompValueEffectImmediately(WDT_ID_Type wdtId, BL_Fun_Type enable)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

    tmpVal = BL_RD_REG(TIMERx, TIMER_WMR);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_WDT_ALIGN, 1 - enable);
    BL_WR_REG(TIMERx, TIMER_WMR, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TIMER get watchdog count register value
 *
 * @param  wdtId: Watchdog ID type
 *
 * @return Watchdog count register value
 *
*******************************************************************************/
uint16_t WDT_GetCounterValue(WDT_ID_Type wdtId)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));

    WDT_ENABLE_ACCESS(TIMERx);

    /* Get watchdog timer count register value */
    tmpVal = BL_RD_REG(TIMERx, TIMER_WVR);

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  TIMER reset watchdog count register value
 *
 * @param  wdtId: Watchdog ID type
 *
 * @return None
 *
*******************************************************************************/
void WDT_ResetCounterValue(WDT_ID_Type wdtId)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));

    /* Reset watchdog timer count register value */
    WDT_ENABLE_ACCESS(TIMERx);

    tmpVal = BL_RD_REG(TIMERx, TIMER_WCR);

    /* Set watchdog counter reset register bit0 to 1 */
    BL_WR_REG(TIMERx, TIMER_WCR, BL_SET_REG_BIT(tmpVal, TIMER_WCR));
}

/****************************************************************************/ /**
 * @brief  TIMER get watchdog reset status
 *
 * @param  wdtId: Watchdog ID type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type WDT_GetResetStatus(WDT_ID_Type wdtId)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));

    WDT_ENABLE_ACCESS(TIMERx);

    /* Get watchdog status register */
    tmpVal = BL_RD_REG(TIMERx, TIMER_WSR);

    return (BL_IS_REG_BIT_SET(tmpVal, TIMER_WTS)) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  TIMER clear watchdog reset status
 *
 * @param  wdtId: Watchdog ID type
 *
 * @return None
 *
*******************************************************************************/
void WDT_ClearResetStatus(WDT_ID_Type wdtId)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));

    WDT_ENABLE_ACCESS(TIMERx);

    tmpVal = BL_RD_REG(TIMERx, TIMER_WSR);

    /* Set watchdog status register */
    BL_WR_REG(TIMERx, TIMER_WSR, BL_CLR_REG_BIT(tmpVal, TIMER_WTS));
}

/****************************************************************************/ /**
 * @brief  TIMER enable watchdog function
 *
 * @param  wdtId: Watchdog ID type
 *
 * @return None
 *
*******************************************************************************/
void WDT_Enable(WDT_ID_Type wdtId)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));

